{
	"basic_info": {
	  "description_header": "Olá!",
	  "description": "👋 Desenvolvedor backend com background em DevOps. Tenho experiência com integração de sistemas, automação de processos, criação e gerenciamento de infraestrutura na AWS. Sou proeficiente em Python, JavaScript, docker, git, gitlab, terraform e serviços AWS como CodePipeline, CodeBuild, EC2, S3, ECS, Lambda, RDS, Route53, Cloudwatch...",
	  "section_name": {
		"about": "Um pouco sobre mim",
		"projects": "Projetos",
		"skills": "Skills",
		"experience": "Experiencias"
	  }
	},
	"projects": [
	  {
		"title": "",
		"startDate": "",
		"description": "",
		"images": [
		  ""
		],
		"url": "",
		"technologies": [
		  {
			"class": "",
			"name": ""
		  }
		]
	  }
	],
	"experience": [
	  {
		"company": "Xcelis Consulting",
		"title": "",
		"description": "",
		"years": "03/2023 - até o momento.",
		"technologies": [
		  ""
		],
		"mainProjects": [
		  {
			"tag": "Em Contrução...",
			"coverPhoto": "images/portfolio/multicloud/diagrama.png",
			"title": "Plataforma Sass / Pass, impulsionada por IA e tecnologias de ponta como AWS, Docker, Terraform, Kubernetes",
			"text": [
			  {
				"topic": "Em construção...",
				"content": "A aplicação envolve a automação e implantação de um solução em nuvem com uma combinação de tecnologias SaaS e PaaS. A infraestrutura da AWS é provisionada e gerida usando Terraform e a aplicação é implantada utilizando Docker e Kubernetes. O processo é automatizado com práticas de CI/CD e aprimorada com assistentes de IA usando OpenAI e Amazon Bedrock, além de uma exploração de estratégias de MultiCloud com Google Cloud e Microsoft Azure."
			  },
			  {
				"topic": "Tecnologias Utilizadas",
				"content": "• Node.js,;• Github,;• Docker,;• Terraform,;• Kubernets,;• OpenAI,;• DynamoDB,;• AWS,;• S3,;• Lambda,;• Bedrock,;• ECR,;• CodePipeline,;• CodeBuild,;• Google BigQuery,;• Azure AI Language."
			  },
			  {
				"topic": "",
				"content": ""
			  },
			  {
				"topic": "",
				"content": ""
			  },
			  {
				"topic": "",
				"content": ""
			  }
			],
			"images": [
			  {
				"titleImage": "",
				"image": ""
			  }
			],
			"videos": [
			  {
				"titleVideo": "",
				"video": ""
			  }
			],
			"url": "",
			"technologies": [
			  {
				"class": ""
			  },
			  {
				"name": ""
			  }
			]
		  },
		  {
			"tag": "Meu Portifólio",
			"coverPhoto": "images/portfolio/leopesi.com.br/capa.png",
			"title": "Single Page Application (SPA), Saas / PaaS, criada com AWS CodePipeline, CodeBuild e servida no S3",
			"text": [
			  {
				"topic": "Camada SaaS",
				"content": "Landing Page feita em React, utilizei componentes reutilizáveis e arquitetura baseada em estado. Os componentes são combinados com Bootstrap para criar uma interface responsiva e a estética mais agradável. Utilizei também o react-router-dom para navegar entre os diferentes componentes e manter a experiência mais fluida."
			  },
			  {
				"topic": "Camada PaaS",
				"content": "A aplicação foi feita utilizando uma série de tecnologias da AWS. Começando pelo AWS CodePipeline, a aplicação inicia seu ciclo de vida buscando o código no repositório GitHub. Depois, o AWS CodeBuild é acionado para compilar, preparar e gerar os artefatos da aplicação. Uma vez que a construção está completa, os artefatos são armazenados em um bucket do Amazon S3. O Amazon CloudFront é utilizado para criar uma entrega rápida e eficiente do site, que é acessado pelo domínio https://leopesi.com.br e gerencuado pelo Route53. O CloudFront também é configurado com um certificado SSL gerenciado pelo AWS Certificate Manager, garantindo seguranca nas requisições."
			  },
			  {
				"topic": "Tecnologias Utilizadas",
				"content": "• React.js,;• Amazon CloudFront,;• AWS Certificate Manager,;• Route 53,;• AWS S3,;• AWS CodePipeline,;• AWS CodeBuild."
			  },
			  {
				"topic": "",
				"content": ""
			  },
			  {
				"topic": "",
				"content": ""
			  },
			  {
				"topic": "",
				"content": ""
			  }
			],
			"images": [
			  {
				"titleImage": "",
				"image": ""
			  }
			],
			"videos": [
			  {
				"titleVideo": "",
				"video": ""
			  }
			],
			"url": "https://github.com/leopesi/leopesi/tree/refactoring",
			"technologies": [
			  {
				"class": ""
			  },
			  {
				"name": ""
			  }
			]
		  },
		  {
			"tag": "Mantis_API",
			"coverPhoto": "images/portfolio/mantis_api/aws-architecture-capa.png",
			"title": "Aplicação, SaaS / PaaS, que usa IA para analisar, resumir e sugerir soluções personalisadas para chamados de TI.",
			"text": [
			  {
				"topic": "Camada SaaS",
				"content": "Ferramenta de gestão de incidentes de suporte de TI. Integrada à intranet (Sharepoint) via iframe, utiliza a Microsoft Graph API para captar a conta de usuário e faz uma requisição na API do MantisBT para captar os tickets associados ao usuário e retorna uma lista com o título e o número do ticket.; O usuário pode pedir uma análise do ticket e então uma outra requisição é enviada para a Gemini API com um script e o json do ticket, que retorna uma análise e resume cada ação aplicada no caso (Se o usuário for do time de suporte a análise retorna sugestões de solução)."
			  },
			  {
				"topic": "Camada PaaS",
				"content": "Infraestrutura (IaC) escrita com Terraform, integrada com GitLab (build/deploy) e versionada com git. Cria uma VPC que define a rede onde os recursos serão implementados. Em seguida, são configuradas as sub-redes públicas e privadas, seguidas pelo grupo de sub-redes do banco de dados.; Depois disso, são configurados os grupos de segurança para controlar o tráfego, incluindo o grupo de segurança do RDS, o do ECS e o do Load Balancer.; Com a rede e a segurança preparadas, a instância do banco de dados RDS é criada, juntamente com o EFS e access point.; Em seguida, a Role IAM necessário para a execução das tarefas ECS é configurado, seguido pela criação do cluster ECS e da Task Definition da aplicação. O Auto Scaling Target para o ECS é então configurado, permitindo a escalabilidade do ECS.; Finalmente, o grupo de destino para o ALB é criado e, por último, é processado o template. Essa sequência garante que todos os recursos necessários estejam prontos antes da criação dos serviços de aplicação e balanceamento de carga."
			  },
			  {
				"topic": "Fluxo",
				"content": " • O tráfego de internet entra no sistema através do ALB, que está nas sub-redes públicas. ; • O ALB distribui esse tráfego para as instâncias ECS rodando nas sub-redes privadas em ambas as zonas de disponibilidade (para alta disponibilidade e balanceamento). ; • As instâncias ECS podem se comunicar com o banco de dados RDS PostgreSQL, que está nas sub-redes privadas. ; • Para se conectar à internet para atualizações ou outros propósitos, as instâncias nas sub-redes privadas passam pelo NAT Gateway, que está em uma sub-rede pública. "
			  },
			  {
				"topic": "Benefícios",
				"content": "Essa arquitetura garante alta disponibilidade, escalabilidade e segurança, ao isolar serviços sensíveis como o banco de dados em sub-redes privadas e distribuir o tráfego em várias zonas de disponibilidade."
			  },
			  {
				"topic": "Tecnologias Utilizadas",
				"content": "• Python / Django,;• PostgreSQL,;• Microsoft Graph API,;• Gemini API,;• MantisBT API,;• Docker,;• Nginx,;• GitLab,;• Terraform,;• ECS (Fargate),;• ECR,;• RDS,;• EFS."
			  }
			],
			"images": [
			  {
				"titleImage": "Diagrama",
				"image": "images/portfolio/mantis_api/aws-architecture.jpg"
			  }
			],
			"videos": [
			  {
				"titleVideo": "",
				"video": ""
			  }
			],
			"url": "Tecnologias Utilizadas",
			"technologies": [
			  {
				"class": "Tecnologias Utilizadas"
			  },
			  {
				"name": "Tecnologias Utilizadas"
			  }
			]
		  }
		]
	  },
	  {
		"company": "Universidad Tecnológica Nacional - Buenos Aires",
		"title": "Intercâmbio",
		"description": "",
		"years": "",
		"iconClass": "graduation",
		"technologies": [
		  ""
		],
		"mainProjects": [
		  {
			"tag": "Proyecto UTN",
			"coverPhoto": "images/portfolio/utn/utn.png",
			"title": "Aplicação Node.js, Sequelize, Express, Bcrypt, Cors, JsonWebToken e backend e no front-end React, Axios e Redux.",
			"text": [
			  {
				"topic": "",
				"content": "O objetivo desse projeto foi colocar em prática alguns dos conceitos abordados no curso de extensão universitária em programação Web – Full Stack Developer, que fiz no segundo semestre de 2022, na Universidad Tecnologica de Buenos Aires (UTN). A aplicação conta com um sistema de registro de usuários, permitindo diferentes níveis de acesso e proporcionando uma experiência personalizada para cada tipo de usuário."
			  },
			  {
				"topic": "Tecnologias:",
				"content": "• A aplicação é construída usando Node.js, Sequelize, Express, Bcrypt, Cors, JsonWebToken no back-end, e React, Axios e Redux no front-end.; • No back-end, temos um sistema de registro de usuário com diferentes níveis de acesso, como Público, Usuário, Moderador e Administrador.; • A autenticação de usuário é feita utilizando JWT, e as senhas são criptografadas usando bcrypt.; • O banco de dados MySQL é utilizado para armazenar as informações dos clientes e seus respectivos endereços, com tabelas separadas e um relacionamento One-to-one.; • No front-end, o React consome a API através do Axios, e o estado da aplicação é gerenciado pelo Redux."
			  },
			  {
				"topic": "Escolha das Tecnologias",
				"content": "Segurança e privacidade: O uso de bcrypt para criptografar senhas e JWT para autenticação garante a segurança das informações dos usuários. ; •  Níveis de acesso: O sistema de registro de usuários com diferentes níveis de acesso permite controlar as permissões de cada usuário dentro da aplicação, assim cada um tem acesso apenas às informações e funcionalidades necessárias. ; • Escalabilidade: Node.js e React são tecnologias escaláveis que permitem que a aplicação seja facilmente expandida. ; • Manutenção: O uso de tecnologias populares e bem documentadas, como Node.js, React e MySQL, facilita a manutenção da aplicação e a contratação de novos desenvolvedores."
			  },
			  {
				"topic": "Prova de rotas",
				"content": "https://www.postman.com/restless-water-10959/workspace/curso-utn-node-js/api/d1301b31-098b-4651-8d18-ee78cb941df8"
			  }
			],
			"images": [
			  {
				"titleImage": "Fluxo de Rotas",
				"image": "images/portfolio/utn/1.jpg"
			  },
			  {
				"titleImage": "",
				"image": "images/portfolio/utn/2.jpg"
			  },
			  {
				"titleImage": "",
				"image": "images/portfolio/utn/3.jpg"
			  },
			  {
				"titleImage": "",
				"image": "images/portfolio/utn/4.jpg"
			  },
			  {
				"titleImage": "",
				"image": "images/portfolio/utn/5.jpg"
			  },
			  {
				"titleImage": "",
				"image": "images/portfolio/utn/6.jpg"
			  },
			  {
				"titleImage": "",
				"image": "images/portfolio/utn/7.jpg"
			  },
			  {
				"titleImage": "",
				"image": "images/portfolio/utn/8.jpg"
			  },
			  {
				"titleImage": "",
				"image": "images/portfolio/utn/9.jpg"
			  },
			  {
				"titleImage": "",
				"image": "images/portfolio/utn/10.jpg"
			  }
			],
			"videos": [
			  {
				"titleVideo": "",
				"video": ""
			  }
			],
			"pdfs": [
			  {
				"titlePDF": "",
				"pdf": ""
			  }
			],
			"url": "https://github.com/leopesi/proyecto_UTN",
			"technologies": [
			  {
				"class": ""
			  },
			  {
				"name": "JavaScript"
			  }
			]
		  }
		]
	  },
	  {
		"company": "Campos Piscinas - São Paulo",
		"title": "Gerente de Projetos - Sócio Proprietário",
		"description": "Assumi um novo e desafiador projeto e tornei-me sócio de uma empresa de construção de piscinas de alvenaria na Grande São Paulo, com 21 anos de mercado. Com a missão de desenvolver a área de projetos, entreguei, em 7 anos, mais de 400 projetos de construção e alguns de inovação. Essa experiência me permitiu desenvolver habilidades como liderança, negociação, gestão de conflitos, gestão de equipes multidisciplinares, inovação e resiliência.",
		"years": "03/2012 - 03/2021",
		"technologies": [
		  ""
		],
		"mainProjects": [
		  {
			"tag": "Contrasseco",
			"coverPhoto": "images/portfolio/contrasseco/arduino.jpg",
			"title": "Sistemas Embarcado de monitoramento de motobomba com C++ e Arduíno",
			"text": [
			  {
				"topic": "Problema:",
				"content": "O setor de piscinas enfrenta um problema frequente de queima de motobombas, que ocorre quando a bomba trabalha a seco, sem a passagem de água pela tubulação. Isso causa o superaquecimento do rotor, o que leva à sua deformação e, eventualmente, à falha completa da motobomba. Vários fatores podem contribuir para o funcionamento a seco da motobomba, incluindo entupimento da tubulação ou obstrução do ralo de sucção. Em alguns casos extremos, crianças podem ficar presas pela sucção no ralo de fundo da piscina, o que pode levar a sérios ferimentos ou até mesmo à morte."
			  },
			  {
				"topic": "Impacto:",
				"content": "Este problema tem impactos negativos, como atrasos no uso da piscina, custos adicionais para substituição ou reparo da motobomba e riscos para a segurança das pessoas que usam a piscina. "
			  },
			  {
				"topic": "Objetivo: ",
				"content": "Desenvolver um sistema de monitoramento e controle automatizado para evitar o funcionamento a seco da motobomba em piscinas, garantindo a segurança das pessoas e prolongando a vida útil do equipamento."
			  },
			  {
				"topic": "Recursos: ",
				"content": "Depois de avaliar várias possibilidades chegamos ao conjunto de tecnologias para a criação do protótipo de teste:;• Microsoft Visio;• Arduíno;• Linhagem C++;• Tinkercad (Programa De Modelagem Tridimensional); • Sensor fluxostato;"
			  },
			  {
				"topic": "Implementação: ",
				"content": "Com um fluxostato instalado no recalque da motobomba é possível indentificar quando o fluxo de água é interrompido, seja por obstrução do ralo de fundo ou aspirador, ar na tubulação ou qualquer outro motivo. Neste instante é acionado o modo NO SAFE do aparelho, que faz algumas tentativas de reestabelecer o fluxo normal, como está ilustrado no fluxograma abaixo. Se o fluxo de água normal for reestabelecido o dispositivo retorna para o modo SAFE , caso contrário é acionado o modo SETUP, que desliga a motobomba e aciona uma luz de alerta."
			  },
			  {
				"topic": "Avaliação: ",
				"content": "O dispositivo obteve resultados pouco satisfatórios por imprecisão dos sensores disponíveis na época, como o sensor de fluxostato que não possibilitava fina da passagem de água.  O algoritmo desenvolvido para o arduíno cumpriu os requisitos do fluxograma de funcionamento. Outras opções de sensores que pudessem oferecer maior precisão encareceria muito o produto final, ficando acima das expectativas de custo do produto."
			  },
			  {
				"topic": "Conclusão:",
				"content": "O dispositivo Contrasseco da Campos Piscinas se demonstrou tecnicamente viável, porém foi o projeto foi paralisado por inviabilidade comercial, já que em baixa escala seria um produto muito caro para o mercado naquele momento."
			  }
			],
			"images": [
			  {
				"titleImage": "Fluxograma",
				"image": "images/portfolio/contrasseco/fluxograma.png"
			  },
			  {
				"titleImage": "Protótipo do Arduino",
				"image": "images/portfolio/contrasseco/arduino.jpg"
			  },
			  {
				"titleImage": "Esquema Eletrônico",
				"image": "images/portfolio/contrasseco/esquema.png"
			  }
			],
			"videos": [
			  {
				"titleVideo": "",
				"video": ""
			  }
			],
			"pdfs": [
			  {
				"titlePDF": "",
				"pdf": ""
			  }
			],
			"url": "https://github.com/leopesi/Contrasseco",
			"technologies": [
			  {
				"class": ""
			  },
			  {
				"name": "Arduino"
			  }
			]
		  },
		  {
			"tag": "Iluminação",
			"coverPhoto": "images/portfolio/iluminacao/Led (2).jpg",
			"title": "",
			"text": [
			  {
				"topic": "Problema:",
				"content": "A iluminação submersa em piscinas sempre foi um ponto crítico em projetos, uma vez que é comum ocorrer infiltração e queima de dispositivos. Isso se deve ao fato de que os dispositivos de iluminação são normalmente câmeras blindadas com uma lente translúcida feita de acrílico ou vidro, e a falha pode ocorrer quando a lente quebra, a vedação da blindagem falha ou, como já aconteceu algumas vezes, água penetra através da fiação elétrica. Como resultado, os problemas de iluminação subaquática levaram a uma taxa elevada de reclamações e aumento nos custos."
			  },
			  {
				"topic": "Objetivo: ",
				"content": "Desenvolver um dispositivo de iluminação subaquática que seja adequado ao ambiente de piscinas."
			  },
			  {
				"topic": "Escopo:",
				"content": "• Design do dispositivo: O novo dispositivo deve ter um design inovador que evite a infiltração de água e proteja a fiação elétrica, reduzindo a ocorrência de falhas.; • Materiais: Os materiais utilizados na construção do dispositivo devem ser de alta qualidade e resistentes à corrosão, garantindo uma longa vida útil e reduzindo a necessidade de manutenção.; • Desempenho: O dispositivo deve fornecer uma iluminação forte e uniforme, com opções de cor e um ângulo de iluminação mínimo de 120º.; • Testes: O dispositivo deve passar por testes rigorosos para garantir que atenda aos padrões de segurança elétrica e resistência à água.; • Compatibilidade: O dispositivo deve ser compatível com os sistemas de iluminação existentes em piscinas.; • Preço: O preço do dispositivo deve ser competitivo em relação a outros dispositivos no mercado.;"
			  },
			  {
				"topic": "Design:",
				"content": "• Material: O dispositivo será confeccionado em aço inoxidável para garantir a resistência à corrosão causada pelo cloro presente na água das piscinas.; • Sistema de fixação: O dispositivo será fixado à piscina por meio de rosca ou encaixe com oring, seguindo o padrão do mercado. Isso facilitará a instalação e manutenção do dispositivo.; • Iluminação: O dispositivo utilizará LEDs SMD, redondo com 300mm de diâmetro, 3 Leds RGB de 3W cada e resistor para 12 V, garantindo uma potência mínima de 9W, para fornecer uma iluminação abrangente e brilhante na piscina. A tecnologia LED também proporciona economia de energia e vida útil mais longa do que outras tecnologias de iluminação.; • Alimentação de energia: O dispositivo será alimentado por uma fonte de energia de 12V, reduzindo o risco de choque elétrico na piscina.; • Impermeabilidade: O design do dispositivo será projetado para garantir que não haja possibilidade de infiltração de água, com vedação adequada dos componentes eletrônicos e da fiação. Isso reduzirá a ocorrência de falhas e aumentará a vida útil do dispositivo.; O novo dispositivo de iluminação subaquática terá um design resistente e eficiente, que garantirá uma iluminação forte e uniforme na piscina, com facilidade de instalação e manutenção. Além disso, a garantia de que não haverá infiltração de água minimizará as falhas e aumentará a segurança dos usuários da piscina."
			  },
			  {
				"topic": "Prototipagem: ",
				"content": "Durante a fase de prototipagem, a equipe enfrentou diversos desafios para encontrar fornecedores qualificados que atendessem às especificações do produto e pudessem garantir a produção em larga escala.; • Nicho do led: Fizemos o desenho técnico para garantir que o protótipo cumpriria os requisitos de compatibilidade e design do escopo.; • Placa PCB: Outra etapa importante foi a criação do esquema eletrônico da placa PCB. A equipe realizou uma pesquisa detalhada de fornecedores no Brasil e na China até encontrar um  que atendesse todas as especificações necessárias.; • Impermeabilidade: A equipe conseguiu encontrar uma solução inovadora, preenchendo todo o nicho com resina epoxi transparente, que oferece ótimas propriedades mecânicas e de resistência ao calor. Essa solução foi crucial para garantir a proteção do dispositivo contra a entrada de água, evitando assim problemas com infiltração.;"
			  },
			  {
				"topic": "Testes: ",
				"content": "Após a fabricação do primeiro lote do produto, a equipe deu início à fase de testes para avaliar a qualidade e a durabilidade do dispositivo. Primeiramente, realizamos testes de resistência, deixando o LED ligado ininterruptamente por 7 dias em um ambiente não aquático para avaliar sua capacidade de resistir ao calor gerado pelo próprio funcionamento.; Além disso, fizemos testes de choque físico para avaliar a resistência da resina e do nicho em aço inoxidável.; A transparência da resina também foi testada através de uma exposição prolongada ao sol para avaliar se suas propriedades seriam perdidas ao longo do tempo.; Em resumo, a fase de avaliação foi crucial para garantir a qualidade e durabilidade do produto. Os testes de resistência e choque físico permitiram que a equipe verificasse a resistência do dispositivo a possíveis impactos e danos, enquanto o teste de transparência da resina garantiu que o produto pudesse manter suas propriedades ao longo do tempo."
			  },
			  {
				"topic": "Lançamento: ",
				"content": "Com o custo de produção em baixa escala dentro do definido no escopo, introduzimos o novo produto no mercado através de nossos cliente, onde passamos a instala-los em todos os novos projetos. Em uma segunda fase, expandimos a venda do produto para o varejo on-line, ampliando ainda mais o alcance e a visibilidade do dispositivo. Com o sucesso das vendas, fechamos um contrato de fornecimento com um distribuidor de produtos de piscina parceiro, garantindo assim uma maior distribuição e alcance do nosso produto."
			  },
			  {
				"topic": "Conclusão: ",
				"content": "O projeto foi altamente satisfatório, pois conseguimos cumprir todos os requisitos definidos no escopo e desenvolvemos um produto inovador, com a utilização da resina epóxi, que garantiu maior segurança e durabilidade para os usuários.; Além disso, a introdução do novo produto no mercado trouxe uma nova fonte de receita para a empresa. O sucesso do projeto é resultado do trabalho conjunto de uma equipe altamente qualificada, que soube enfrentar os desafios e superar as dificuldades ao longo de todo o processo."
			  }
			],
			"images": [
			  {
				"titleImage": "",
				"image": "images/portfolio/iluminacao/Led (2).jpg"
			  },
			  {
				"titleImage": "Ilustração de Instalação",
				"image": "images/portfolio/iluminacao/DesenhoInstalação (2).jpg"
			  },
			  {
				"titleImage": "Ângulo de Iluminação",
				"image": "images/portfolio/iluminacao/Amplitude.jpg"
			  },
			  {
				"titleImage": "Desenho Técnico",
				"image": "images/portfolio/iluminacao/DesenhoDispositivo (1).jpg"
			  },
			  {
				"titleImage": "",
				"image": "images/portfolio/iluminacao/DesenhoDispositivo (2).jpg"
			  },
			  {
				"titleImage": "Desenho da Placa PCB",
				"image": "images/portfolio/iluminacao/PCBLED.jpg"
			  }
			],
			"videos": [
			  {
				"titleVideo": "",
				"video": ""
			  }
			],
			"pdfs": [
			  {
				"titlePDF": "",
				"pdf": ""
			  }
			],
			"url": "",
			"technologies": [
			  {
				"class": ""
			  },
			  {
				"name": ""
			  }
			]
		  },
		  {
			"tag": "EasyPool",
			"coverPhoto": "images/portfolio/easy-pool/capa.png",
			"title": "Ferramenta SaaS para orçamento de piscinas feita em Node.js, Vue.js, SQL",
			"text": [
			  {
				"topic": "Problema:",
				"content": "A indústria de piscinas está em constante crescimento, o que exige dos construtores a habilidade de fornecer orçamentos precisos e confiáveis para garantir a satisfação do cliente e a rentabilidade do projeto. No entanto, a elaboração de um orçamento para uma piscina personalizada pode ser uma tarefa complexa, envolvendo diversos fatores, como dimensões, materiais, insumos, serviços e formas de pagamento. Atualmente, os profissionais do setor enfrentam o desafio de elaborar orçamentos precisos sem o auxílio de ferramentas tecnológicas adequadas, o que pode resultar em erros na elaboração do orçamento e prejuízos para o construtor."
			  },
			  {
				"topic": "Objetivo: ",
				"content": "Desenvolver um software para o setor de piscinas que auxilie os construtores na elaboração de orçamentos precisos e eficientes, com a automatização dos processos envolvidos, visando garantir a satisfação do cliente e a rentabilidade do projeto, aprofundar a profissionalização do setor e aumentar a competitividade dos profissionais no mercado."
			  },
			  {
				"topic": "Escopo:",
				"content": "•  Análise de requisitos: Realizar uma análise detalhada dos requisitos funcionais e não funcionais do software, considerando as necessidades dos construtores de piscinas, clientes e do mercado.;  •  Design e desenvolvimento do software: Criar uma arquitetura robusta e escalável do software, utilizando tecnologias de ponta.;  •  Testes e validação: Realizar testes rigorosos em todas as funcionalidades do software, a fim de garantir a qualidade e confiabilidade do mesmo, validando também os requisitos levantados.; • Implantação e treinamento: Realizar a implantação do software, oferecendo treinamento e suporte técnico para os usuários, visando garantir a sua adoção e o sucesso do projeto.; • Manutenção e evolução: Realizar manutenções corretivas e evolutivas do software, a fim de garantir a sua atualização e adequação às novas necessidades do mercado.; • Resultados esperados: Desenvolver um software especializado para o setor de piscinas que auxilie os construtores na elaboração de orçamentos precisos e eficientes, com a automatização dos processos envolvidos, visando garantir a satisfação do cliente e a rentabilidade do projeto, aprofundar a profissionalização do setor e aumentar a competitividade dos profissionais no mercado.;"
			  },
			  {
				"topic": "MVP:",
				"content": "Por se tratar de uma ferramenta que reúne vários insumos, mão de obras, formas de pagamento e personalização das medidas e formato da piscina. Foi criado um MVP (minimum value product) em Excel para simular e testar as funcionalidades."
			  },
			  {
				"topic": "Testes do MVP: ",
				"content": "• Objetivos: Avaliar o desempenho e a funcionalidade do MVP em diferentes cenários de uso e obter feedback dos usuários finais e outras partes interessadas.;  • Critérios: O MVP deve ser capaz de gerar cotações de forma rápida, precisa e confiável, considerando as variáveis e especificações de cada projeto. O MVP deve ser fácil de usar e intuitivo.;  • Ferramentas: Para realizar os testes, será utilizado um modelo feito em Excel para simular todas os cenários de cotação, questionários para coletar feedback dos usuários e entrevistas por telefone."
			  },
			  {
				"topic": "Análise: ",
				"content": "Após a realização dos testes na ferramenta EasyPool, foram obtidas algumas conclusões relevantes para o seu desenvolvimento. Primeiramente, foi constatado que é necessário criar um projeto de UI e UX, a fim de aprimorar a experiência do usuário e garantir que a ferramenta alcance seus objetivos. Isso se deve ao fato de que a EasyPool possui diversos recursos e opções de configuração, o que pode tornar a sua utilização complexa e difícil para alguns usuários.; Além disso, foi observado que o cálculo de piscinas personalizadas requer inputs extras e específicos de cada projeto, como o cálculo do perímetro, maior comprimento e maior largura, que precisam ser feitos manualmente. Para facilitar esse processo, seria recomendado a introdução de modelos sugeridos de piscinas com formatos irregulares, que poderiam ser adaptados às necessidades de cada usuário.; Outro ponto destacado nos testes foi a validação das fórmulas criadas para os cálculos das dimensões da piscina, dimensionamento dos equipamentos, formas de pagamento, lista de materiais, etc. Todas as fórmulas foram conferidas e aprovadas, garantindo a precisão dos cálculos e a confiabilidade das informações fornecidas pela EasyPool."
			  }
			],
			"images": [
			  {
				"titleImage": "MVP - Tela de Orçamento",
				"image": "images/portfolio/easy-pool/planilha.png"
			  },
			  {
				"titleImage": "MVP - Opções de Pagamento",
				"image": "images/portfolio/easy-pool/planilha2.png"
			  },
			  {
				"titleImage": "",
				"image": ""
			  }
			],
			"videos": [
			  {
				"titleVideo": "EasyPool - Vídeo de Apresentação",
				"video": "https://www.youtube.com/embed/EFTK-K8jWsI"
			  }
			],
			"pdfs": [
			  {
				"titlePDF": "MVP - Lista de Materiais",
				"pdf": "images/portfolio/easy-pool/MVP - EasyPool - back-up.pdf"
			  },
			  {
				"titlePDF": "Documento de Requisitos",
				"pdf": "images/portfolio/easy-pool/Documento de Requisitos EasyPool.pdf"
			  }
			],
			"url": "www.leopesi.com.br",
			"technologies": [
			  {
				"class": ""
			  },
			  {
				"name": ""
			  }
			]
		  }
		]
	  }
	]
  }